Revit 2027 API
FabricSheet.GetBendProfile Method
 Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop GetBendProfile()
Public Function GetBendProfile As CurveLoop
public:
CurveLoop^ GetBendProfile()
member GetBendProfile : unit -> CurveLoop
Return Value
CurveLoop
 The profile that defines the shape of the fabric sheet bending for bent fabric sheet, for flat fabric sheet null will be returned.
Remarks
 The returned profile defines the center-curve of a wire. Note that bent Fabric Sheets can have planar geometry, but flat Fabric Sheets are always planar.
Example
#region Autodesk.Revit.DB.Structure.FabricSheet.SetBendProfile(Autodesk.Revit.DB.CurveLoop)
private void ModifyBentFabricSheet(Document document, FabricSheet bentFabricSheet)
{
   CurveLoop newBendingProfile = CurveLoop.CreateViaOffset(bentFabricSheet.GetBendProfile(), 0.5, new XYZ(0, 0, -1));
   bentFabricSheet.SetBendProfile(newBendingProfile);
   // Give the user some information
   TaskDialog.Show("Revit", string.Format("Bent Fabric Sheet ID='{0}' modified successfully.", bentFabricSheet.Id.ToString()));
}
#endregion
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace